; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	infrared2 - mode
	image1 - mode
	spectrograph3 - mode
	thermograph4 - mode
	thermograph0 - mode
	Star4 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph4)
	(supports instrument3 image1)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
)
(:goal (and
	(have_image Planet8 thermograph4)
	(have_image Planet9 infrared2)
	(have_image Planet10 thermograph4)
	(have_image Planet11 thermograph4)
	(have_image Planet12 image1)
	(have_image Planet13 thermograph0)
	(have_image Phenomenon14 thermograph4)
	(have_image Planet15 thermograph0)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 8
2. (calibrate satellite2 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 8
3. (turn_to satellite2 planet11 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet11)
   goals met: 0 of 8
4. (take_image satellite2 planet11 instrument3 thermograph4)
   added: (have_image planet11 thermograph4)
   goals met: 1 of 8
5. (turn_to satellite2 planet10 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet10)
   goals met: 1 of 8
6. (take_image satellite2 planet10 instrument3 thermograph4)
   added: (have_image planet10 thermograph4)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon14 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
9. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 2 of 8
10. (take_image satellite2 phenomenon14 instrument3 thermograph4)
   added: (have_image phenomenon14 thermograph4)
   goals met: 3 of 8
11. (turn_to satellite0 planet13 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet13)
   goals met: 3 of 8
12. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 4 of 8
13. (turn_to satellite0 planet15 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet15)
   goals met: 4 of 8
14. (take_image satellite0 planet15 instrument0 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 5 of 8
15. (turn_to satellite0 planet8 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet8)
   goals met: 5 of 8
16. (take_image satellite0 planet8 instrument0 thermograph4)
   added: (have_image planet8 thermograph4)
   goals met: 6 of 8
17. (turn_to satellite2 planet12 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet12)
   goals met: 6 of 8
18. (take_image satellite2 planet12 instrument3 image1)
   added: (have_image planet12 image1)
   goals met: 7 of 8
19. (turn_to satellite2 planet9 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet9)
   goals met: 7 of 8
20. (take_image satellite2 planet9 instrument3 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 8 of 8
